https://www.hackerrank.com/challenges/occupations/problem

In [1]:
%load_ext sql

In [2]:
%sql mysql://root:root@localhost

In [3]:
%%sql

create schema occ;
use occ;

create table if not exists occupations (name varchar(100), occupation varchar (100));

insert into occupations (name, occupation)  values ('Sam','Doctor');
insert into occupations (name, occupation)  values ('J','Actor');
insert into occupations (name, occupation)  values ('Maria','Actor');
insert into occupations (name, occupation)  values ('Meera','singer');
insert into occupations (name, occupation)  values ('Ashley','Professor');
insert into occupations (name, occupation)  values ('Ketty','Professor');
insert into occupations (name, occupation)  values ('c','Professor');
insert into occupations (name, occupation)  values ('Jane','Actor');
insert into occupations (name, occupation)  values ('Jen','Doctor');
insert into occupations (name, occupation)  values ('Priya','Singer');

 * mysql://root:***@localhost
1 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [9]:
%%sql

select * from occupations;

 * mysql://root:***@localhost
10 rows affected.

[('Sam', 'Doctor'),
 ('J', 'Actor'),
 ('Maria', 'Actor'),
 ('Meera', 'singer'),
 ('Ashley', 'Professor'),
 ('Ketty', 'Professor'),
 ('c', 'Professor'),
 ('Jane', 'Actor'),
 ('Jen', 'Doctor'),
 ('Priya', 'Singer')]

In [26]:
%%sql
select t.name, t.occupation
from (select name, occupation, count(occupation) over (partition by occupation) as 'partition'
from occupations) as t

 * mysql://root:***@localhost
10 rows affected.

[('J', 'Actor'),
 ('Maria', 'Actor'),
 ('Jane', 'Actor'),
 ('Sam', 'Doctor'),
 ('Jen', 'Doctor'),
 ('Ashley', 'Professor'),
 ('Ketty', 'Professor'),
 ('c', 'Professor'),
 ('Meera', 'singer'),
 ('Priya', 'Singer')]

In [37]:
%%sql

select 
case when occupation='Doctor' then Name
end as Doctor,
case when occupation='Singer' then Name
end as Singer,
case when occupation='Professor' then Name
end as Professor,
case when occupation='Actor' then Name
end as Actor
from occupations

 * mysql://root:***@localhost
10 rows affected.

[('Sam', None, None, None),
 (None, None, None, 'J'),
 (None, None, None, 'Maria'),
 (None, 'Meera', None, None),
 (None, None, 'Ashley', None),
 (None, None, 'Ketty', None),
 (None, None, 'c', None),
 (None, None, None, 'Jane'),
 ('Jen', None, None, None),
 (None, 'Priya', None, None)]

In [95]:
%%sql

select max(t.Doctor) as Doctor, max(t.Professor) as Professor, max(t.Singer) as Singer, max(t.Actor) as Actor
from 
(select row_number() over (partition by occupation order by name) as 'row_number', 
case when occupation='Doctor' then Name else Null
end as Doctor,
case when occupation='Professor' then Name else Null
end as Professor,
case when occupation='Singer' then Name else Null
end as Singer,
case when occupation='Actor' then Name else Null
end as Actor
from occupations
order by name) as t
group by t.row_number

 * mysql://root:***@localhost
3 rows affected.

[('Jen', 'Ashley', 'Meera', 'J'),
 ('Sam', 'c', 'Priya', 'Jane'),
 (None, 'Ketty', None, 'Maria')]